#pragma once
// 存放Sprite对象相关的数据
#include "T_Engine/T_Engine.h"
// 僵尸种类
#define ZOMBIE_TYPE_NUM 4
// 僵尸每种状态基本帧序列数量
#define ZOMBIE_SEQUENCE_NUM 132
#define PLANT_SEQUENCE_NUM 132
// 植物种类数
#define PLANT_TYPE_NUM 4

// 僵尸初始化需要的一些参数
// 速度
static const int NORMAL_ZOMBIE_SPEED = 2;
static const int JUMP_ZOMBIE_SPEED = 4;
static const int PAPER_ZOMBIE_SPEED = 1;
// 攻击力
static const int NORMAL_ZOMBIE_POWER = 250;
// 生命值
static const int NORMAL_ZOMBIE_LIVE = 1000;
// 出现位置
static const int ZOMBIE_APPEAR_Y[5] = { 10, 108, 216, 314, 412 };
static int ZOMBIE_APPEAR_X[8] = { 1080, 1130, 1180, 1230, 1280, 1330, 1380, 1430 };

// 初始化植物以及僵尸需要的数据封装成结构体
typedef struct
{
	wstring img;
	int frameWidth;
	int frameHeight;
}ZOMBIEINFO, PLANTINFO;


//植物卡片相关配置
static const wstring CARDBOARD = L".\\res\\cardBoard\\cardBoard.png";			//植物卡片菜单图片
static const wstring TEXTBG = L".\\res\\cardBoard\\textBg.png";
static const wstring SUNFLOWER_CARD = L".\\res\\cardBoard\\SunFlower.png";		//太阳花
static const wstring PEASHOOTER_CARD = L".\\res\\cardBoard\\Peashooter.png";	//豌豆射手
//// TODO 需要解决素材问题 
//static const wstring ICEPEASHOOTER_CARD = L".\\res\\plant\icepeashooter"
static const wstring WALLNUT_CARD = L".\\res\\cardBoard\\WallNut.png";			//坚果
static const wstring SQUASH_CARD = L".\\res\\cardBoard\\Squash.png";			//倭瓜
static const wstring POTATO_CARD = L".\\res\\cardBoard\\PotatoMine.png";		//土豆

//
//==============================================
//僵尸类型
//==============================================
enum ZOMBIE_TYPE
{
	NORMAL_ZOMBIE,		// 普通僵尸
	FLAG_ZOMBIE,		// 旗手僵尸
	JUMP_ZOMBIE,		// 跳高僵尸
	PAPER_ZOMBIE,		// 读报僵尸
};

//==============================================
//僵尸状态
//==============================================
enum ZOMBIE_STATE
{
	STATIC_STATE,			//站立状态
	WALK_STATE,				//走动状态
	ATTACK_STATE,			//攻击状态
	BOOM_STATE,				//炸死状态
	LOSTHEADWALK_STATE,		//掉头走动状态
	LOSTHEADATTACK_STATE,	//掉头攻击状态
	DIE_STATE,				//死亡状态
	DISAPPEAR_STATE,		//僵尸消失状态
	// 道具消失之后的状态
	TOOL_LOSE_WALK,			// 道具丢失之后的行走状态
	TOOL_LOSE_ATTACK,		// 丢失道具之后的攻击状态
	TOOL_LOSE_NOHEAD_WALK,	// 丢失道具之后的无头行走
	TOOL_LOSE_NOHEAD_ATTACK,	// 丢失道具之后的无头攻击
};

//==============================================
//植物状态
//==============================================
enum PLANT_STATE
{
	PLANT_STATIC_STATE,		//植物静止状态
	PLANT_STAND_STATE,		//植物站立状态
	PLANT_SHOOT_STATE,		//植物发射状态
	PLANT_BOOM_STATE,		//植物爆炸状态
	PLANT_SUN_STATE,		//植物阳光状态
	PLANT_DEAD,				//植物死亡
	PLANT_MILD_DAMAGE,		//植物轻度损坏
	PLANT_HEAVY_DAMAGE,		//植物重度损坏
};
// 植物类型
enum PLANT_TYPE
{
	PEASHOOTER,		//豌豆射手
	SUNFLOWER,		//向日葵
	WALLNUT,		//小坚果
	ICEPEASHOOTER,	//寒冰射手
};

//==============================================
//植物参数
//==============================================


// 等待时间
static const int WAITTIME[PLANT_TYPE_NUM] = { 6, 5, 12, 8 };
// 消耗阳光
static const int COSTSUN[PLANT_TYPE_NUM] = { 100, 50, 50, 150 };
// 生命值
static const int PLANTE_REMAINLIVE[PLANT_TYPE_NUM] = { 1400, 1400, 1400, 1400 };
// 护甲
static const int PLANT_DEFENCE[PLANT_TYPE_NUM] = { 100, 100, 5000, 100};
// 攻击力
static const int PLANT_POWER[PLANT_TYPE_NUM] = { 150, 0, 1000000, 120,  };
// 豌豆子弹图片
static const wstring PEASHOOTER_WEAPON = L".\\res\\plant\\peashooter\\bullet.png";
// 寒冰射手子弹图片
static const wstring ICEPEASHOOTER_WEAPON = L".\\resplant\\icepeashooter\\bullet.png";
// 击中图片
static const wstring PEASHOOTER_WEAPON_HIT = L".\\res\\plant\\peashooter\\bulletHit.png";

//==============================================
//植物图片素材
//==============================================


//植物静止图片
static const wstring plantStatic[PLANT_TYPE_NUM] =
{
	L".\\res\\plant\\peashooter\\peaShooterStatic.png",
	L".\\res\\plant\\SunFlower\\SunFlowerStatic.png",
	L".\\res\\plant\\wallnut\\wallNutStatic.png",
	L".\\res\\plant\\icepeashooter\\icepeaShooterStatic.png",
};

// 植物素材
static PLANTINFO PLANTSTAND[PLANT_TYPE_NUM] =
{
	{ L".\\res\\plant\\peashooter\\Peashooter.png", 71, 71 },
	{ L".\\res\\plant\\SunFlower\\SunFlower.png", 73, 74 },
	{ L".\\res\\plant\\wallnut\\wallNut1.png", 65, 73 },
	{ L".\\res\\plant\\icepeashooter\\icePeashooter.png", 71, 71 },
};

//阳光连帧图
static PLANTINFO SUNPIC = { L".\\res\\plant\\sun\\sun.png", 79, 79 };

//==============================================
//植物序列
//==============================================

// 向日葵站立序列
static int SUNFLOWERSTAND_FRAME[PLANT_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,
	10,10,10,10,10,10,10,
	11,11,11,11,11,11,11,
	12,12,12,12,12,12,12,
	13,13,13,13,13,13,13,
	14,14,14,14,14,14,14,
	15,15,15,15,15,15,15,
	16,16,16,16,16,16,16,
	17,17,17,17,17,17,17
};
// 向日葵工作序列
static int SUNFLOWERWORK_FRAME[PLANT_SEQUENCE_NUM] =
{
	18,18,18,18,18,18,18,18,
	19,19,19,19,19,19,19,19,
	20,20,20,20,20,20,20,20,
	21,21,21,21,21,21,21,21,
	22,22,22,22,22,22,22,22,
	23,23,23,23,23,23,23,23,
	24,24,24,24,24,24,24,
	25,25,25,25,25,25,25,
	26,26,26,26,26,26,26,
	27,27,27,27,27,27,27,
	28,28,28,28,28,28,28,
	29,29,29,29,29,29,29,
	30,30,30,30,30,30,30,
	31,31,31,31,31,31,31,
	32,32,32,32,32,32,32,
	33,33,33,33,33,33,33,
	34,34,34,34,34,34,34,
	35,35,35,35,35,35,35,
};


// 豌豆射手站立帧序列
static int PEASHOOTERSTAND_FRAME[PLANT_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,9,9,9,
	10,10,10,10,10,10,10,10,10,10,
	11,11,11,11,11,11,11,11,11,11,
	12,12,12,12,12,12,12,12,12,12,
};
// 寒冰射手站立帧序列
static int ICEPEASHOOTERSTAND_FRAME[120] =
{
	0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,9,
	10,10,10,10,10,10,10,10,
	11,11,11,11,11,11,11,11,
	12,12,12,12,12,12,12,12,
	13,13,13,13,13,13,13,13,
	14,14,14,14,14,14,14,14,
};

// 坚果墙序列
// 坚果站立序列
static int WALLNUTSTAND_FRAME[PLANT_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,9,9,
	10,10,10,10,10,10,10,
	11,11,11,11,11,11,11,
	12,12,12,12,12,12,12,
	13,13,13,13,13,13,13,
	14,14,14,14,14,14,14,
	15,15,15,15,15,15,15,
};

// 坚果轻度损坏
static int WALLNUT2STAND_FRAME[PLANT_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,9,9,9,9,9,9,9
};

// 坚果重度损坏
static int WALLNUT3STAND_FRAME[PLANT_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,9,
	10,10,10,10,10,10,10,10,
	11,11,11,11,11,11,11,11,
	12,12,12,12,12,12,12,12,
	13,13,13,13,13,13,13,13,
	14,14,14,14,14,14,14,14,
	15,15,15,15,15,15,15,15,
};

//==============================================
//僵尸序列
//==============================================

// 选择静态僵尸素材:普通僵尸、读报纸僵尸、跳高僵尸、旗手僵尸
static ZOMBIEINFO normalZombieStatic[ZOMBIE_TYPE_NUM] =
{
	{ L".\\res\\zombie\\normalZombie\\normalZombieStatic1.png", 166, 144 },
	{ L".\\res\\zombie\\PaperZombie\\static.png", 218, 166 },
	{ L".\\res\\zombie\\JumpZombie\\static.png", 350, 220 },
	{ L".\\res\\zombie\\FlagZombie\\static.png",166,144 }
};

//==============================================
// 普通僵尸
//==============================================

// 开场时右边的不行走的僵尸帧序列
static int NORMAL_ZOMBIE_STATIC_FRAME[ZOMBIE_TYPE_NUM][ZOMBIE_SEQUENCE_NUM] =
{
	{
		0,0,0,0,0,0,0,0,0,0,0,0,
		1,1,1,1,1,1,1,1,1,1,1,1,
		2,2,2,2,2,2,2,2,2,2,2,2,
		3,3,3,3,3,3,3,3,3,3,3,3,
		4,4,4,4,4,4,4,4,4,4,4,4,
		5,5,5,5,5,5,5,5,5,5,5,5,
		6,6,6,6,6,6,6,6,6,6,6,6,
		7,7,7,7,7,7,7,7,7,7,7,7,
		8,8,8,8,8,8,8,8,8,8,8,8,
		9,9,9,9,9,9,9,9,9,9,9,9,
		10,10,10,10,10,10,10,10,10,10,10,10,
	},
	{
		0,0,0,0,0,0,
		1,1,1,1,1,1,
		2,2,2,2,2,2,
		3,3,3,3,3,3,
		4,4,4,4,4,4,
		0,0,0,0,0,0,
		1,1,1,1,1,1,
		2,2,2,2,2,2,
		3,3,3,3,3,3,
		4,4,4,4,4,4,
		0,0,0,0,0,0,
		1,1,1,1,1,1,
		2,2,2,2,2,2,
		3,3,3,3,3,3,
		4,4,4,4,4,4,
		0,0,0,0,0,0,
		1,1,1,1,1,1,
		2,2,2,2,2,2,
		3,3,3,3,3,3,
		4,4,4,4,4,4,
		0,0,0,0,0,0,
		1,1,1,1,1,1,
	},
	{
		0,0,0,0,0,0,0,0,0,0,0,0,
		1,1,1,1,1,1,1,1,1,1,1,1,
		2,2,2,2,2,2,2,2,2,2,2,2,
		0,0,0,0,0,0,0,0,0,0,0,0,
		1,1,1,1,1,1,1,1,1,1,1,1,
		2,2,2,2,2,2,2,2,2,2,2,2,
		0,0,0,0,0,0,0,0,0,0,0,0,
		1,1,1,1,1,1,1,1,1,1,1,1,
		2,2,2,2,2,2,2,2,2,2,2,2,
		0,0,0,0,0,0,0,0,0,0,0,0,
		1,1,1,1,1,1,1,1,1,1,1,1,
	},
	{
		0,0,0,0,0,0,
		1,1,1,1,1,1,
		2,2,2,2,2,2,
		3,3,3,3,3,3,
		4,4,4,4,4,4,
		0,0,0,0,0,0,
		1,1,1,1,1,1,
		2,2,2,2,2,2,
		3,3,3,3,3,3,
		4,4,4,4,4,4,
		0,0,0,0,0,0,
		1,1,1,1,1,1,
		2,2,2,2,2,2,
		3,3,3,3,3,3,
		4,4,4,4,4,4,
		0,0,0,0,0,0,
		1,1,1,1,1,1,
		2,2,2,2,2,2,
		3,3,3,3,3,3,
		4,4,4,4,4,4,
		0,0,0,0,0,0,
		1,1,1,1,1,1,
	},
};

static ZOMBIEINFO normalZombieWalk[3] =
{
	{ L".\\res\\zombie\\normalZombie\\normalZombieWalk1.png", 166, 144 },
	{ L".\\res\\zombie\\normalZombie\\normalZombieWalk2.png", 166, 144 },
	{ L".\\res\\zombie\\normalZombie\\normalZombieWalk3.png", 166, 144 }
};
static int NORMAL_ZOMBIE_WALK_FRAME[3][ZOMBIE_SEQUENCE_NUM] =
{
	{
		0,0,0,0,0,0,
		1,1,1,1,1,1,
		2,2,2,2,2,2,
		3,3,3,3,3,3,
		4,4,4,4,4,4,
		5,5,5,5,5,5,
		6,6,6,6,6,6,
		7,7,7,7,7,7,
		8,8,8,8,8,8,
		9,9,9,9,9,9,
		10,10,10,10,10,10,
		11,11,11,11,11,11,
		12,12,12,12,12,12,
		13,13,13,13,13,13,
		14,14,14,14,14,14,
		15,15,15,15,15,15,
		16,16,16,16,16,16,
		17,17,17,17,17,17,
		18,18,18,18,18,18,
		19,19,19,19,19,19,
		20,20,20,20,20,20,
		21,21,21,21,21,21,
	},
	{
		0,0,0,0,0,
		1,1,1,1,1,
		2,2,2,2,2,
		3,3,3,3,3,
		4,4,4,4,4,
		5,5,5,5,5,
		6,6,6,6,6,
		7,7,7,7,7,
		8,8,8,8,
		9,9,9,9,
		10,10,10,10,
		11,11,11,11,
		12,12,12,12,
		13,13,13,13,
		14,14,14,14,
		15,15,15,15,
		16,16,16,16,
		17,17,17,17,
		18,18,18,18,
		19,19,19,19,
		20,20,20,20,
		21,21,21,21,
		22,22,22,22,
		23,23,23,23,
		24,24,24,24,
		25,25,25,25,
		26,26,26,26,
		27,27,27,27,
		28,28,28,28,
		29,29,29,29,
		30,30,30,30,
	},
	{
		0,0,0,0,0,0,0,0,
		1,1,1,1,1,1,1,1,
		2,2,2,2,2,2,2,2,
		3,3,3,3,3,3,3,3,
		4,4,4,4,4,4,4,4,
		5,5,5,5,5,5,5,5,
		6,6,6,6,6,6,6,
		7,7,7,7,7,7,7,
		8,8,8,8,8,8,8,
		9,9,9,9,9,9,9,
		10,10,10,10,10,10,10,
		11,11,11,11,11,11,11,
		12,12,12,12,12,12,12,
		13,13,13,13,13,13,13,
		14,14,14,14,14,14,14,
		15,15,15,15,15,15,15,
		16,16,16,16,16,16,16,
		17,17,17,17,17,17,17
	},
};

static ZOMBIEINFO normalZombieAttack = { L".\\res\\zombie\\normalZombie\\normalZombieAttack.png", 166, 144 };
static int NORMAL_ZOMBIE_ATTACK_FRAME[ZOMBIE_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,
	6,6,6,6,6,6,
	7,7,7,7,7,7,
	8,8,8,8,8,8,
	9,9,9,9,9,9,
	10,10,10,10,10,10,
	11,11,11,11,11,11,
	12,12,12,12,12,12,
	13,13,13,13,13,13,
	14,14,14,14,14,14,
	15,15,15,15,15,15,
	16,16,16,16,16,16,
	17,17,17,17,17,17,
	18,18,18,18,18,18,
	19,19,19,19,19,19,
	20,20,20,20,20,20,
};
static ZOMBIEINFO zombieBoomDie = { L".\\res\\zombie\\zombieBoomDie.png", 166, 144 };
static int ZOMBIE_BOOM_DIE_FRAME[ZOMBIE_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,
	10,10,10,10,10,10,10,
	11,11,11,11,11,11,11,
	12,12,12,12,12,12,
	13,13,13,13,13,13,
	14,14,14,14,14,14,
	15,15,15,15,15,15,
	16,16,16,16,16,16,
	17,17,17,17,17,17,
	18,18,18,18,18,18,
	19,19,19,19,19,19,
};
static ZOMBIEINFO zombieDie = { L".\\res\\zombie\\zombieDie.png", 166, 144 };
static int NORMAL_ZOMBIE_DIE[ZOMBIE_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,9,9,9,9,9,9,
};
static ZOMBIEINFO zombieHead = { L".\\res\\zombie\\zombieHead.png", 150, 186 };
static int NORMAL_ZOMBIE_HEAD[ZOMBIE_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,9,9,9,9,
	10,10,10,10,10,10,10,10,10,10,10,
	11,11,11,11,11,11,11,11,11,11,11,
};
static ZOMBIEINFO zombieLostHead = { L".\\res\\zombie\\zombieLostHead.png", 166, 144 };
static int NORMAL_ZOMBIE_LOSTHEAD_WALK[ZOMBIE_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,
	10,10,10,10,10,10,10,
	11,11,11,11,11,11,11,
	12,12,12,12,12,12,12,
	13,13,13,13,13,13,13,
	14,14,14,14,14,14,14,
	15,15,15,15,15,15,15,
	16,16,16,16,16,16,16,
	17,17,17,17,17,17,17
};
static ZOMBIEINFO zombieLostHeadAttack = { L".\\res\\zombie\\zombieLostHeadAttack.png", 166, 144 };
static int NORMAL_ZOMBIE_LOSTHEAD_ATTACK[ZOMBIE_SEQUENCE_NUM] =
{
	0,0,0,0,0,0,0,0,0,0,0,0,
	1,1,1,1,1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,9,9,9,9,9,
	10,10,10,10,10,10,10,10,10,10,10,10,
};


//==============================================
// 读报僵尸
//==============================================

// 行走
// 攻击
// 愤怒行走
// 愤怒攻击
// 掉头行走
// 头部掉落
// 头部掉落攻击
// 报纸掉落状态
// 倒下


//==============================================
// 撑杆跳僵尸
//==============================================
// 冲刺
// 跳跃
// 头部掉落冲刺
// 失去道具之后的攻击
// 失去道具之后的行走
// 失去头部后的攻击
// 无头行走
// 头部掉落
// 倒下